[
  {
    "id": "entry-1768490372904",
    "name": "Elliot",
    "date": "2026-04-18",
    "title": "Diary Entry",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">A couple of days on and I drew supply run duty. Proper one this time, outside the walls and into town. Skipton again, but deeper. Five of us packed into a small van that’s seen better decades. A strange mix of metal, leather, and layered cloth armour between us, like history got drunk and dressed us in the dark.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I kept my shortbow in hand the whole drive. Quiver strapped tight at my hip. This wasn’t wall work. No longbows, no arcs and ranges and patience. Streets are close, messy. You need something quick. A hammer hung on my other hip, solid and comforting in the way only blunt tools are.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">We split up near the high street, pairs peeling off toward pharmacies and hardware shops. I headed straight for the camping supply store I’d circled on the map days ago. I’d studied those maps until the folds went soft and the streets felt memorised.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Inside, the first thing I did was sit down.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I kicked off my ruined trainers and swapped them for a proper pair of hiking boots from the shelf. Thick soles. Good ankle support. I laced them tight and stood, stamping once. Immediate improvement. Feet matter more than almost anything now.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Then I stripped the place for all it was worth.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Expedition gear first. Heavy-duty packs, spare straps, dry bags, carabiners, cord. Anything designed to survive mountains could survive this.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><div style=\"\"><span style=\"font-size: 16.8px;\">I grabbed the largest hiking rucksack I could find, the kind meant to carry someone’s entire bad decision across a continent. Dehydrated rations followed, swept into the bag by the armful. Calories without fuss.</span></div><div style=\"\"><span style=\"font-size: 16.8px;\"><br></span></div><div style=\"\"><span style=\"font-size: 16.8px;\">I moved on to the tents and stopped being gentle. I ripped bags open, pulling out fiberglass poles and snapping them down to workable lengths. Perfect stock for crossbow bolts once cut and fletched. Improvised, sure, but straight and strong. I cleared the shelves of water filtration tablets. Every single one. Clean water is time.</span></div><div style=\"\"><span style=\"font-size: 16.8px;\"><br></span></div><div style=\"\"><span style=\"font-size: 16.8px;\">I was slinging the loaded rucksack onto my shoulder when I heard it.</span></div><div style=\"\"><span style=\"font-size: 16.8px;\"><br></span></div><div style=\"\"><span style=\"font-size: 16.8px;\">A low moan, wet and unfinished, drifting from behind the till. Staff area.</span></div><div style=\"\"><span style=\"font-size: 16.8px;\"><br></span></div><div style=\"\"><span style=\"font-size: 16.8px;\">I dropped instantly, sliding in behind a crate of folded camp chairs. The rucksack hit the floor softly beside me. I drew an arrow, breath slow, and leaned just enough to peer around the edge.</span></div><div style=\"\"><span style=\"font-size: 16.8px;\"><br></span></div><div style=\"\"><span style=\"font-size: 16.8px;\">A figure on the floor. Legs destroyed, smashed beyond use by whoever looted the place before me. Left there. Still moving. Still suffering.</span></div><div style=\"\"><span style=\"font-size: 16.8px;\"><br></span></div><div style=\"\"><span style=\"font-size: 16.8px;\">I muttered, barely audible, “Lazy buggers. Finish the job.”</span></div><div style=\"\"><span style=\"font-size: 16.8px;\"><br></span></div><div style=\"\"><span style=\"font-size: 16.8px;\">The arrow took it clean through the skull.</span></div><div style=\"\"><span style=\"font-size: 16.8px;\"><br></span></div><div style=\"\"><span style=\"font-size: 16.8px;\">Silence again.</span></div><div style=\"\"><span style=\"font-size: 16.8px;\"><br></span></div><div style=\"\"><span style=\"font-size: 16.8px;\">I didn’t waste time after that. I hauled the rucksack back up, swept a handful of pocket knives from the display case by the door, and ran. Out into the street, scanning windows and alleys as I made for the van.</span></div><div style=\"\"><span style=\"font-size: 16.8px;\"><br></span></div><div style=\"\"><span style=\"font-size: 16.8px;\">We didn’t say much on the drive back.</span></div><div style=\"\"><span style=\"font-size: 16.8px;\"><br></span></div><div style=\"\"><span style=\"font-size: 16.8px;\">But my feet didn’t hurt.</span></div><div style=\"\"><span style=\"font-size: 16.8px;\">And the haul was good</span></div></div>",
    "read": false
  },
  {
    "id": "entry-1768490400064",
    "name": "Nathan",
    "date": "2026-04-15",
    "title": "Taxi Ride",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">I leaned out of the side window of a battered looking old taxi. That had been Anna's idea - great turning circle, regularly maintained to a high standard, and great fuel capacity. It wasn't mine officially, of course, and it wouldn't be giving lifts to the public anytime soon: behind the plastic screen, there was barely room to move between the piles and piles of supplies. Tins of food and soup, animal feed, seeds, soil, fencing, and a pile of tools which would have been considered expensive until a couple of weeks ago, but now would be considered priceless. B&amp;Q was a risky stop, and I suspected pickings would be slim, but it turned out that looters seemed reluctant to check the back rooms of the shops they were ransacking.&nbsp;</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Given the circumstances, maybe that was sensible.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The view before me was hard to comprehend.</span></div><div><span style=\"font-size: 16.8px;\">The M1 was considered a hellscape by most people on a normal day, but now? An overturned lorry blocked the northbound carriageway, and abandoned vehicles dotted the landscape, both on and off the road. People had clearly tried to swerve to avoid it, but the barriers and the trees had proved too much, and there was no way through.</span></div><div><span style=\"font-size: 16.8px;\">Well, if you were on the left side of the road, that is.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">\"This is definitely a bit risky,\" I said, creeping up the hard shoulder on the right side of the road. Even a week ago, horns would be blaring and the police would already be on their way, but now traffic was sparse, and passed by wide, comparatively slowly. Nobody wanted to die in a car crash in the apocalypse; there's far more exciting ways to die than that these days. There were abandoned cars on pretty much every road occasionally, with little sign of occupancy.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Guess they got hungry.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">\"I might get a ticket or something,\" I continued, swerving around an ambulance with its wheels pointed to the sky. The siren continued to blare, a morbid reminder that things were not as they once were. \"I can see why people told me to avoid the motorways.\"</span></div><div><span style=\"font-size: 16.8px;\">Nobody replied, of course. Not even an eye roll. I glanced to my left, where Pringle sat perched on the passenger seat, looking at me intently. I sighed, and gave her a little scratch under her chin. She licked my hand back.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Anna was in Ibiza. Trust her to pick the weekend before the end of the world to fly out with the girls! No danger for them yet, last I’d heard. Phone signal’s been pretty patchy though, and I haven’t heard anything for a couple of days.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">A parking bay slipped by on the right, and I hit the brakes, moving even slower. The exit was coming up soon, and trying to read the signs across the central reservation with cars zooming across you was a recipe for missing your exit. With a sharp U-turn, I let out a sigh of relief, wheels rolling up the exit ramp.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">“Remind me to never do that again,” I said, glancing at the signs. Huddersfield. My phone buzzed as I approached civilisation, moving ever closer to Skipton. It’s hard to believe that infrastructure collapsed so quickly that the journey had taken nearly three days.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I parked up at a petrol station, but kept the doors locked and the engine running. No point in trying to get fuel any more. The windows of the attached store were shattered, and the sign told me that the price had hit fifteen pounds a litre before they had finally given up. Unbelievable.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I took a quick sip of water, and stole a look at my phone. Best to make use of the signal while I had it.</span></div><div><span style=\"font-size: 16.8px;\">“TRUMP TAKES GREENLAND, BUT AT WHAT COST?!” read the headline, the picture showing a burning White House. I rolled my eyes, flicking the notification away before tapping on discord, typing out a few words quickly. My eyes kept darting to the windows, keeping an eye out for any movement.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">“Still alive” I typed, pausing as a pigeon landed on the petrol dispenser, beady eyes seeming to stare directly at me. Pringle growled. Something in my gut churned.</span></div><div><span style=\"font-size: 16.8px;\">I glanced back at my phone, tapping out a few more characters.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">“Still alive. Watch out for birds. I’ll be there by nightfall.”</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I read the words, and then reread them. Am I being paranoid?</span></div><div><span style=\"font-size: 16.8px;\">A second pigeon landed next to the first, claws gripping the handle of the diesel dispenser. Pringle let out a strange whine-bark, and my spine tingled. I hit send, and without waiting for a response I hit the gas.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Tyres squealed as the taxi lurched back onto the road.</span></div><div><span style=\"font-size: 16.8px;\">The birds followed.</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490417922",
    "name": "Elliot",
    "date": "2026-04-15",
    "title": "PM entry",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">The day wound down without anything catching fire that wasn’t meant to, which feels like success. As the light faded and watch shifts changed, I retreated to one of the side rooms off the barracks with a mug of something pretending to be tea and my most important duty of the evening.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Game prep.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">It feels ridiculous admitting it, even in here. But D&amp;D has become our guilt pleasure, our pressure valve. A few hours where the walls are just scenery and danger is measured in dice, not teeth. In a place built for vigilance, it’s the closest thing we have to rest.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">No D&amp;D Beyond, no tablets, no tidy digital indexes. Just weight. I spread the tomes of knowledge out across the table, pages soft with age and fingerprints, margins packed with notes from people who never thought they’d be doing this by candlelight in a castle. I ran my fingers over spell lists and monster entries like they might rearrange themselves into something easier.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I sketched until my hand cramped. An intricate mansion, all sharp angles and secret corridors, every room carefully planned. In the basement, I made sure the vault was obvious. Too obvious. Heavy door, ridiculous locks, the kind of thing that practically screams distraction. Let them argue about it. Let them overthink.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Then I pulled out a children’s riddle book I’d scavenged days ago, the cover half chewed and the pages stained with something sticky. I flipped through until I found the right one and wove it into the puzzle, childish on the surface, cruel underneath. The best kind.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I leaned back, listening to the muffled sounds of the castle settling around me. Boots on stone. A laugh cut short. Wind through canvas.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">“This should take them plenty of time,” I muttered to myself, smiling despite everything.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">If the world is going to end, it can wait until after initiative is rolled.</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490443289",
    "name": "Eve",
    "date": "2026-04-16",
    "title": "The apocalypse is great!",
    "contentHtml": "<div>I can spend all day spinning wool or carding fibers and no one yells at me for waisting the day doing stupid things.&nbsp;</div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Fuck you industrial revolution you wrecked the simple way of life. Its not easy, have to be up to feed the animals and then it's all day sewing or spinning or weaving. I'm so glad I brought my hand crank machine (ok industrial revolution you where right in some places)&nbsp;</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">They keep saying I will get fed up with it at somepoint but sewing cloths and bags and useful things has never been so rewarding. If I want a break I just hop on a scout mission to go \"shopping for fabric\" we have even found two COUNT EM two treddel machines aswell. Its great. Being part of a little team of seamstress is great we just sit and knit and sew and crochet and natter and gossip and tell storys.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The only down side. Having to teach people how to thread a needed makes me want to murder.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Other than that life is sweet here. Fuck social this was a longtime coming and we are better for it.</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490464315",
    "name": "Elliot",
    "date": "2026-04-15",
    "title": "Training day",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">It’s been a few days now, long enough for the castle to stop feeling like borrowed space and start feeling like somewhere I might actually wake up tomorrow. I slid out of my bunk before the bell, careful not to kick the frame. The barracks were already alive in that quiet, purposeful way. People moving without talking, like noise itself might cost us something.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Stone under boots, breath fogging faintly, I headed for the storage hall. The place smells of dust, oil, and old grain. I picked up the day’s supply request forms from the table near the door. Paper everywhere, clipped, folded, smudged. Requests for bandages, lamp oil, dried food, bolts for crossbows. The kind of lists that make chaos look manageable. I tucked them under my arm and told myself that meant I was useful.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">On the way out, I glanced up at the walls. An archer stood watch above the gate, bow resting easy but ready. He caught my eye. I gave a small nod. He returned it without smiling. Trust, measured out in millimetres.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">In the yard, a scouting party was rolling out. A battered minivan, once blue, now a patchwork of rust and taped-on armour. Someone had painted a crude symbol on the side in yellow. I raised a hand and gave them a wave. One of them leaned out the window and waved back, wide grin, like they were heading off on a school trip instead of into whatever waits beyond the walls. The gate groaned open just long enough to let them through, then sealed again.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Beyond the inner wall, tucked into a corner where the wind is kinder, sits the trade school. A generous name for a shelter built from scavenged scaffolding and stretched canvas. The ropes are well tied. That alone makes me feel better.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">A small group waited underneath. The ones who didn’t pass the skill triage. No obvious trades, no tidy labels. Just people with hands, backs, and fear they’re trying not to show. A couple clutched mugs. One</span></div><div><span style=\"font-size: 16.8px;\">was chewing on a bit of string like it might tell them what to do.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I stepped under the canvas, dropped the supply forms onto a crate, and clapped once.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">“Right,” I said. “This is Fire 101.”</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">They focused immediately.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">“Heat. Healing. Sterilization. Communication,” I paused, then added, “and arson.”</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">That last word rippled through them. A nervous laugh. A raised eyebrow. Good. Fire deserves respect.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I laid out the kit. Firesteel worn smooth, tinder bundles, clean cloth, a kettle blackened by a hundred boils. I talked about warmth and cooking, about sealing wounds and cleaning tools. About smoke signals and light at distance. About how fire can keep you alive, and how it will kill you just as easily if you get lazy.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">By the end, their hands were steadier. Not confident. Not yet. But steadier. In this place, that counts as progress.</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490481867",
    "name": "James",
    "date": "2026-04-14",
    "title": "Patrol",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">James walks around the castle checking on the day to day workings of everything. What he doesnt know how to run he makes sure there is someone who does.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">When there hasnt been any sighting of the infected for a day or so he'll be seen without his helmet on but never without his configured cpap mask. Folks arent sure if its paranoia or some preempative measure but its clear he thinks either whats causing this is airborne or in time it will be.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Its not a new eden, nor is the castle a paradise. People are medically triaged, the 'useful' are prioritised over those who lack in skills and whilst it is a safe environment generally there is a scent of fear in the air over what the world has become as it is still early days in the outbreak.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">In one of the ancillairy buildings is a table with a large map. Skipton itself is divided into districts with sightings of infected pinned. Resources are noted be they farms, forests, unpolluted rivers or even buildings that have not yet scavanged.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Every few hours there are teams going in and out. Some by foot and some by car using the limited reserves of fuel to scout surrounding areas, often willing to take whatever help they can.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">A few other structures appear up as 'lean tos' against the ancient stone walls. Where once it was wood and thatch now there is PVC piping and canvas. Of these buildings are a trade school teaching those who fail the initial 'skill triage' some useful trades, a field hospital tending to scouts, soldiers and refugees alike and a scrap shop for hoarders alike to rummage through scavanged material to make things of use to the inhabitants of the castle</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490499236",
    "name": "Cat",
    "date": "2026-04-01",
    "title": "Silly pranks",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">Dear diary,</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Guess I'm back to journaling!? That therapist may have not been the greatest, but she was right about journaling. At least, it's worked in the past and I'll do anything at this point in time to ease the anxiety. Got to rationalise it all or something.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">It started like any old Wednesday. Waking up for work, hurriedly getting ready and driving there only to arrive early. I opened the department, letting my computer boot up in the office as I opened the windows and boiled the kettle for my colleagues; my typical 'opening shift'. I eventually settled at my desk, letting my mouse drift onto the news tab I keep perpetually open in my browser for some absent scrolling and information gathering. After looking at the local stuff, I went into the country wide page, expecting to see some comments on PMQ's and updates on the various conflicts of the world but, dominating the screen was an article about 'April Fool's Day'. Of course, the date has passed me by in a haze of counting down until the next holiday and I chuckled to myself, opening the article. I only got a brief glimpse, glancing at phrases such as 'practical joke' and 'internet craze' before one of my colleagues came in and I resigned myself to office small talk until my first lesson.</span></div><div><span style=\"font-size: 16.8px;\">Lunchtime came and went with little fanfare, sitting down to eat and check emails before being pulled away to sort out some of the exam technology that had broken. I'd get to my endless to do list eventually, the students were the priority and the admin could get done later. The article had slipped my mind in the blur of 1:1 sessions and note taking and emotional regulation, so when I arrived in the final class of the day, I couldn't stop myself from listening in when I heard the word \"zombie\" in a conversation between some of the teenagers. I can't remember what was exactly said, but it was something like this:</span></div><div><span style=\"font-size: 16.8px;\">Student A: \"... has been updating all day. They started off saying it was something local, but it seems to be spreading.\"</span></div><div><span style=\"font-size: 16.8px;\">Student B: \"Well of course! The secondary schools are all kicking out and the kids are all jumping in on it for the TikTok views.\"</span></div><div><span style=\"font-size: 16.8px;\">Student A: \"I don't think it's just kids though...\"</span></div><div><span style=\"font-size: 16.8px;\">Student C: \"He's right, I got forwarded a video of a load of adults chasing people in a park.\"</span></div><div><span style=\"font-size: 16.8px;\">Student B: \"I bet it was for some sort of drama thing. Or maybe a film? These things can be from AI too. Was it forwarded from your Gran or something?\"</span></div><div><span style=\"font-size: 16.8px;\">Student C: \"Oh shut up! It was one time and I...\"</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">They were cut off by the teacher coming in and getting their attention. The register was taken, the content delivered and the conversation forgotten. My brain kept on turning over on what I knew. Surely the police would stop large groups from chasing individuals? That was harassment or something! I vowed to keep an eye out on the way home, especially if it appeared to be 'spreading'.</span></div><div><span style=\"font-size: 16.8px;\">Driving home was uneventful, and I almost forgot the events of the day until after dinner when I checked my messages to see a few people checking in to make sure I was ok. I replied that all was well; I'm not the kind of person to advertise when I'm struggling or ask for help, and then check ins from multiple people made me do a double take. The responses seemed relieved, if not a little on edge, and, when I asked everyone what they were on about, they just sent me back the link to the news article. It seemed that this 'prank' was going on into the night, with people appearing to take it as an excuse to raid shops. Pietro messaged saying that their mum had seen someone smashing the window of Tesco as she drove out the car park, and had asked them to check on me, as I wasn't too far. I reassured both Pietro and their mum with a text that all was well, but kept the article open. Something felt off, and I didn't want to miss out on what the broadcasters said.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">All evening, I've been on edge, thinking about people being stupid and taking pranks too far. Rationally and logically, I know it'll all blow over tonight, especially if it's some sort of prank, I just can't help but feel a little panicked though, like we're on the edge of something huge. Writing it all out makes it seem a little clearer, it's just some huge pop culture moment that is getting out of hand. I don't want it to be like lockdown, where it's not taken seriously until it's too late. Maybe I'll check the article again...</span></div>",
    "read": true
  },
  {
    "id": "entry-1768490519144",
    "name": "Charles",
    "date": "2026-04-13",
    "title": "Fucking Mondays",
    "contentHtml": "<div>It's Monday, why does shit always go south on a fucking Monday? Stocked up the van with food, armour, camping supplies and my tools.&nbsp;</div><div><span style=\"font-size: 16.8px;\">Me and Evie have got the animals and made sure they were safe as I checked oil and pumped the tyres up with air.</span></div><div><span style=\"font-size: 16.8px;\">&nbsp;looking over my shoulders, trusty hickory handle estwing hammer in hand i was ready to spring like a steel coil clamped too hard in a vice.&nbsp;</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The ride to my work was a quick drive due how out of the way site was.</span></div><div><span style=\"font-size: 16.8px;\">I grabbed as many jerry cans of diesel as I could pump from the bowser and smashed the lock of the storage containers, two small generators was all I could fit snug side by side in the back of the transit.&nbsp;</span></div><div><span style=\"font-size: 16.8px;\">The drive was silent and tense I'm keeping to the the country roads to avoid people. the fog is rolling in as a I get closer to Skipton, I've seen so much abandoned cattle and sheep on the way,</span></div><div><span style=\"font-size: 16.8px;\">My phone vibrates in the cab cupholder.</span></div><div><span style=\"font-size: 16.8px;\">\"At the Castle. Gates are shut. Get here.\"</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490543887",
    "name": "Eve",
    "date": "2026-04-13",
    "title": "Home Sweet Castle",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">We arrived at the castle with little fanfare other than the well-meaning threats. We let the lads go first under the guise of chivalry; mostly it was because I had the lorry in reverse, so if things did go south we could skedaddle out of there while the boys caused a distraction.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I wasn’t that worried, we had the text from James as an excuse to at least stay the night, but you always need an escape route, and overall I still had the bigger vehicle — a change from my little baby Kevin. But you’re more likely to survive the breakdown of society in a 4x4 than a hairdryer strapped to a roller skate.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">After much posturing (Jordan) and much discussion with the trigger-happy crossbowman (Elliot), they opened the gate. I was surprised they let us keep our weapons, but was promptly distracted from that surprise by the wonderful sight of Morgana prowling over to inspect us. Oh, and James was looking down on us from the battlements, shouting in a stupid French accent, “Your mother was a hamster and your father smelt of elderberries.”</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Things are looking up</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490561404",
    "name": "James",
    "date": "2026-04-13",
    "title": "Setting Up",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">A few of the earlier reenactor arrivals had already made good headway on the interior. The old kitchen within the castle was reformed as its original purpose with the great hall acting as an administrative centre where details of refugees and their skill sets were noted.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The chapel had become an armoury. Farmer's shotguns stood beside crossbows as if a descendant meeting their ancestor.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Rudimentry defences had been set up along the base of the curtain walls with the occassional dead infected cadaver in front of the main gatehouse being burned periodically by the garrison.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">What ground within the castle walls wasnt taken up by tents, sleeping spaces and storage became raised beds for vegetables and crops, a small corall in the corner already hosted some goats, cattle, geese and chickens.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I knew a fair few of those who had already setup inside. Cliffords mostly but generally reenactors of many colours. The blue and yellow checkered flag of the cliffords flew just above a familiar yellow and green.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I didnt have much time to go around outside of my armour. I had already been saved from an infected bite by my chunky gambeson.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Hearing the sound of multiple vehicles turn up i walked to the ramparts and looked down, another familiar colour of green and yellow. I scribble quickly on a notepad and hand it to one of the guards</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">\"If any come in with these names, dont confiscate their weapons and let them through, they'll be using one of two sets of names. All others process as normal\"</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Its quite clear the list has a collection of 'real' names and 'larp' names.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">\"OPEN THE GATE\"</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">with a loud creak and the sound of bolts sliding, those who have arrived can enter to be greeted by an all too familiar grey cat with white socks as James looks down with his helmet on</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490582597",
    "name": "Cat",
    "date": "2026-04-12",
    "title": "Time to Convoy",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">I was driving in the woods when Eve's message came through. The location pin wasn't too far off; I could make it there within the hour. The boot was full of spare tools, wool and other odd supplies that altogether made a ramshackle bank of supplies. The woods were eerie as I unlocked the door to the Guide hut. I picked out what I could, squeezing tarps next to saucepans, unsure of what we'd be missing. The wind began to pickup, carrying with it sounds of movement. Increasing my speed, I packed what I could into the car, before driving away. I had to get to the others.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Driving in convoy, we found the service station, loading supplies into the transit like a well oiled machine. Everything fit together like a game of Tetris, with an air of chaos and disorganisation. We all squeezed together in the cab, agreeing to take turns in driving. Stopping at this stage is risky, especially as the van has made us a larger, well supplied target for other groups. The radio hums with static, discordant and busy. I watch as the miles tick by, trying to keep my hands busy with some knitting; surely we'll need some things to keep warm with? Keeping awake and aware is important, and I absent mindedly watch the scenery roll by as we drive towards the North.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I jump a little as someone's phone buzzes. I look down, we all get the same message from James. I think it may be the last update we get for a while...</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">\"At the Castle. Gates are shut. Get here.\"</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490601024",
    "name": "Elliot",
    "date": "2026-04-13",
    "title": "Stocking Up",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">I didn’t take the main roads today. Too exposed. Too many eyes. I moved through towns like a ghost, slipping in where I could, taking what mattered, leaving the rest to rot.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The pharmacy was first. Glass already smashed, shelves half-looted, that sharp chemical smell hanging in the air. I grabbed anything that looked useful. Painkillers, antibiotics, bandages, antiseptic. Stuff people will need if this goes on. Stuff I will need. I didn’t linger. Every second inside felt like tempting fate.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The library was worse, somehow. Quiet in a way that felt wrong. Pages scattered like leaves after a storm. I filled my bag with textbooks. Herbal medicine. Foraging. Survival manuals. Old stuff, written back when people expected the world to end every few generations. There’s comfort in that. Proof that someone’s been here before and made it through.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The museum nearly broke me. Not emotionally. Practically. I stood there staring at suits of armour behind glass, weapons mounted on the walls like trophies, and all I could think was how stupid it was that we ever stopped using what worked. Medieval plate, chainmail, gambesons. Blades, polearms, shields. I took what I could carry. Heavy. Awkward. Real. It felt ridiculous and completely necessary all at once.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I hit an electronics shop on the way out of town. Radios, walkie-talkies, batteries, chargers. Anything that still worked went in the boot. If we’re going to survive, we need to talk to each other. Silence gets you killed.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I met up with Eve, Rhi, and Cat at a service station just off the bypass. They were already busy. Fuel siphoned from dead cars into jerry cans. Rhi halfway inside a lorry cab, wires hanging out like veins. Eve keeping watch. Cat grinning like she’d always known it would come to this.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">They got the engine going. Loud. Ugly. Beautiful.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I followed the lorry north, keeping my distance, watching it</span></div><div><span style=\"font-size: 16.8px;\">carve a path through empty roads. Skipton rose out of the distance like something out of a storybook, stone walls and old bones standing stubborn against the end of everything.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">We stopped at the gatehouse. No one said anything at first. Then we raised the banner. Yellow and green, quartered, catching the wind like it still mattered. Like we still mattered.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">We called out together, voices echoing off the stone.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">“Gregor! I mean—James!”</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I held my hands up, away from my belt. I’ve never felt more exposed in my life. I’m standing in the shadow of 900 years of history, hoping my mate is actually inside and hasn't lost his mind.</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490615418",
    "name": "Evie",
    "date": "2026-04-12",
    "title": "Seeya Sheffield",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">We had to pack up as much as we could to leave Sheffield. We heard from our friends that they were all heading to Skipton for safety.\u000b</span></div><div><span style=\"font-size: 16.8px;\">Coco was pacing around, knowing something was wrong. I wish I could explain to her that home wasn't going to be home anymore. Pippin? Honestly, she was soundly sleeping next to the radiator... It felt cruel to wake her from her slumber and take her away from her home, but what else could we do?</span></div><div><span style=\"font-size: 16.8px;\">\u000bI grabbed all the food we had that wouldn’t perish quickly. It would only last us a few weeks, maybe a couple of months at best, but it was better than nothing. Charles was gathering his tools to fix anything that needed it... or, in the worst case scenario, to use as weapons.\u000b</span></div><div><span style=\"font-size: 16.8px;\">We loaded up the van with whatever essentials we could think of (medication, blankets, warm clothing, etc.) with the limited time we had. We’d heard the roads were going to get busy soon.\u000b</span></div><div><span style=\"font-size: 16.8px;\">I placed Coco in the footwell on her dog bed and Pip in her carrier on the dashboard. Trying to keep them calm is heartbreaking. They're not stupid...now they could see for themselves that the world is no longer the same.\u000b</span></div><div><span style=\"font-size: 16.8px;\">The ride is deafeningly silent. No longer are the days of laughing and singing along to Alice in Chains to pass the time. Everything feels dull and heavy.</span></div><div><span style=\"font-size: 16.8px;\">We stopped at one point at Charlies work site to grab some bits, honestly I was too shaken up to even notice much around me, all I remember is I was told to stay in the van and don't open the door for any reason.</span></div><div><span style=\"font-size: 16.8px;\">\u000bI can't stop shaking. The van feels stuffy, but I also can’t handle what would happen once we reached our destination.\u000b</span></div><div><span style=\"font-size: 16.8px;\">I know Charlie won’t stay put for long. He’d want to go out and find more supplies as soon as he knew that me and the animals were safe. He hasn’t said anything, but I know he will, and I feel selfish for not wanting him to leave...</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Both our phones vibrate.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">It's James.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">\"At the Castle. Gates are shut. Get here.\"</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490631273",
    "name": "Jordan",
    "date": "2026-04-13",
    "title": "Skipton Castle",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">We’re at the gates. Skipton is different. Everywhere else we’ve been has been loud - screaming, engines, that wet, tearing sound those things make. But here? It’s eerily still. There are abandoned cars littering the High Street, doors left wide open, suitcases spilled out onto the pavement, but no movement. The silence is worse than the noise.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I pulled the car up as close to the gatehouse as I could. The massive doors are shut tight. I switched off the engine and for a second, I just sat there, hands shaking on the steering wheel. Poppy is standing in the back, her nose pressed against the glass.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I got out. The air smells like woodsmoke and campfires.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I looked up, and nearly shit myself. The battlements were manned with people, but they weren't cheering. They were watching us like we were a threat. A surreal mix, some of them are in surplus military gear and high-vis vests, holding cricket bats wrapped in barbed wire or old hunting rifles. But others... others look like they’ve stepped out of a history book. I saw a guy in a full gambeson holding a pike that must have been five hundred years old.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">There’s no trust left. You can feel it in the air - cold and hostile. To them, I’m just another desperate person who might be carrying the sickness. One of the blokes on the wall, wearing a riot helmet and holding a heavy-looking crossbow, leveled it at my chest.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">\"Stay there!\" he shouted. His voice cracked. He’s terrified.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I held my hands up, away from my belt. I’ve never felt more exposed in my life. I’m standing in the shadow of 900 years of history, hoping my mate is actually inside and hasn't lost his mind.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">\"I'm looking for James!\" I yelled back, trying to keep my voice from shaking. \"Tell him Jordan is here. From the Crosslands!\"</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Nobody moved. The guy with the crossbow didn't lower it. I can hear Minty meowing in the back of the car, she’s fed up, and honestly, I’m right there with her. I just need them to open the bloody door.</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490650505",
    "name": "Rhiannon",
    "date": "2026-04-12",
    "title": "Time to go",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">Leaving Romsey behind felt wrong. In the early morning light, the town was silent, abandoned in a way I’d never experienced before. The few people left, including Ben next door who had given me his van, we too stubborn to leave their homes.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I’d grabbed as much useful crap from Moles as I could, stocking up on clothes, hot water bottles, all the food they had. Even gardening tools; they’ll be useful for planting the seeds I’d got. I’d also grabbed the cavalry saber and the truncheon from home, along with all of my camping equipment, and every warm thing I could find.&nbsp; I'm just grateful that when this all started I stockpiled my insulin, it'll at least last me a while, as long as I do my best to ration it along with the rest of my medications.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Map on the seat next to me, I started out towards the motorway, heading to the distribution centre where I planned to meet up with Eve and Cat; our phones were still working for now. The roads were deserted; in the movies you always see them packed with the panicked masses, but reality is much quieter. The world didn’t end with a bang, it just feels like it went to sleep.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I took a risk detouring to the office, but I know there are useful supplied there; the bonus of the garaged being full of engineer’s equipment and heaters. If we can get a generator set up, those radiators will be a godsend come winter. I can’t risk going any further into Winchester, especially with the hospital nearby, so this is my last stop until I met the others.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">At the distribution centre, I get started siphoning all the fuel I can, we’ll need as much as possible for the future. There’s a garage next door with a small shop, so I take the wagon over there to grab everything I can, food, drinks, toiletries, the lot. As I hear another vehicle approaching, my phone vibrated in my pocket.&nbsp;</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Message from James - “At the Castle. Gates are shut. Get here.”</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I guess it’s time to go</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490677928",
    "name": "Jordan",
    "date": "2026-04-12",
    "title": "Maybe I'll be back, York",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">We had to leave York. It wasn't a choice. Those people, or whatever they are, are everywhere. It’s not like they’re dead; they’re just... wrong. Violent.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The drive towards Skipton is a nightmare. I’m trying to keep us on the back roads, avoiding anywhere too busy.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">My brain is constantly running through lists: fuel, water, weapons, safety. I’m trying to keep Jenni calm, but honestly, I'm about to have a meltdown. She spent the night in the car hand-sewing clothes together to make them thicker.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Poppy is sitting in the back, staring out the window. She saw one of them run across the road and she didn't bark, she just let out this low, vibrating growl I’ve never heard from her before.&nbsp;</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">It’s like she knows things have changed. Minty is in her carrier, hissed out. I feel like a bastard for putting them through this, but I couldn't leave them behind.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">James sent a text - last one that came through.&nbsp;</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">“At the Castle. Gates are shut. Get here.”</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490701666",
    "name": "Eve",
    "date": "2026-04-12",
    "title": "Time to hijack a lorry!!",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">We left Bordon just after dawn. The town was quiet in the way a room is quiet after a party — cups still out, doors open, nobody home. I went back to the flat once for the important things: weapons, first aid, camping gear, and the cat carrier containing Bemish and Schrödinger, who both felt the need to express their feelings about this situation loudly and at length. They did not approve. They have never approved of anything.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">We picked up Cat first, who had a backpack, a crowbar, and a very strong opinion about not being eaten by anything today. Rhiannon was further north at a service station, siphoning diesel with the casual competence of someone who had clearly been waiting her whole life for societal collapse. I didn’t ask questions. I just held the funnel.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The Transit van was sitting behind a distribution centre, white paint scuffed, logo half peeled, keys still in it like the universe wanted us to take the hint.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">We loaded everything that wasn’t nailed down — food, water, medical supplies, blankets, batteries, pet food, and enough tins to start our own very depressing shop. The back of the van now smells like diesel, peaches, and fear. It’s not an improvement, but it’s not terrible.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The cab is full of practical nonsense. Knives wrapped in tea towels. An axe wedged behind the seat. Firelighters rattling every time we hit a bump. I keep patting things like I’m checking they’re still real. I hope the skills I taught so casually come back to me when they matter. Shelter. Fire. Keeping people busy so they don’t panic. I’m trying to believe that includes preparing for the end of the world.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The engine hums. The world feels hollow. Bemish is asleep. Schrödinger is staring out the window like he’s judging my lane discipline.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">James sent a text. Last one that came through.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">\"At the Castle. Gates are shut. Get here\"</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490723375",
    "name": "Elliot",
    "date": "2026-04-12",
    "title": "A full car",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">We had to get out early, before the roads filled with whatever passes for traffic now. The motorways were empty in that unsettling way, long grey ribbons stretching ahead with no headlights coming the other way. Overhead signs flicked past like warnings meant for someone else. Every slip road felt like a gamble.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The back of the car is crammed to the roof with kit from the scout hut. Tents, roll mats, mess tins, coils of rope, boxes of half-used fuel tabs. Things that once smelled of damp weekends and burnt sausages now feel like treasure. I broke the lock myself. Told myself I would come back and make it right. I don’t believe that lie, but it helped me turn the key.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I keep replaying the plan in my head because it’s the only thing holding me together. Get to Skipton. The old castle. Group up. Make a plan that’s bigger than just surviving the next mile. I say it silently like a mantra as the white lines tick by.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The passenger seat is a mess of sharp, practical comfort. Axes stacked awkwardly, knives wrapped in cloth, firelighting kits rattling every time I brake. I pat them without thinking, the way you check your pockets for keys. I hope the skills I taught so casually come back to me when it matters. Shelter, fire, keeping people busy so they don’t panic. I’ve always told the kids that preparation is kindness. I’m trying to believe it now.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Nobody’s talking much. The car hums, the world feels hollow, and I don’t know what waits at the end of the road. I just know we have to keep moving.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">James sent a text. Last one that came through.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">“At the Castle. Gates are shut. Get here.”</span></div>",
    "read": false
  },
  {
    "id": "entry-1768490741706",
    "name": "James",
    "date": "2026-04-10",
    "title": "Got to get to the castle",
    "contentHtml": "<div><span style=\"font-size: 16.8px;\">The van rattles, Leeds hadnt been hit by the outbreak yet but that didnt stop the looting.</span></div><div><span style=\"font-size: 16.8px;\">\"Billhooks, halbards, falchions, as much armour as i could grab\"</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">I took a lengthy detour north of bradford, frantically calling my reenactment mates first to meet at the castle but each call sapped the battery.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Avoiding the M62 i got to rawtenstall to grab biffy who loaded the van with their fabrics and anything else useful from my own house; blankets, jerky, weapons, armour, we even lobbed the black fluff Macey onto the middle seat.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">By the time we got to Skipton a small gaggle of the Cliffords were already there reinforcing the gatehouse and dragging in supplies and other survivors. There werent many as the bulk of the town had foolishly fled to the cities thinking they were safer there.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Breathe... breathe.... breathe. I was running the scenario so many times in my head but when push comes to shove it doesnt prepare you for the reality.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">The gates were locked and guards were posted on the walls with polearms and bows, we made a start on organising peoples skills and where they would bunk or camp.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">It was April fortunately which meant we could make a start on growing crops and dealing with long term issues now without worrying about a winter cold snap. We stationed a lookout atop the nearby Trinity Church, where once fire wardens stood in the war now someone stands looking for survivors or watching for the infected.</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">As the night began to set, that last thing i feared turned up on my phone: \"1%\"</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">Mulling it over i sent out one last message before the phone died:</span></div><div><span style=\"font-size: 16.8px;\"><br></span></div><div><span style=\"font-size: 16.8px;\">\"At the Castle. Gates are shut. Get here\"</span></div>",
    "read": false
  }
]